bricks/roi/roi.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ЯНАО, региональный этап РОИ 2014/2015</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Пароли</i>
</p>


<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left"><b><b>Второй тур</b></b></td>
<td class="left">&#xa0;</td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000067&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left"><b><b>Первый тур</b></b></td>
<td class="left">&#xa0;</td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000064&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Первый тур. Дорешивание</td>
<td class="left"><a href="./tour1.doc">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000066&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Пробный тур</td>
<td class="left"><a href="./region_training.pdf">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000060&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Командная олимпиада</td>
<td class="left">&#xa0;</td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000061&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Вложенные циклы</td>
<td class="left"><a href="http://ejudge.oplab.org/05-nested-loops/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=0000062&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Одномерные массивы</td>
<td class="left"><a href="http://ejudge.oplab.org/06-arrays-1d/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000063&locale_id=1">Вход</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Изменения в процедуре проверки</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Обращаем внимание, что в этом году существенно изменились требования по проверке и оцениванию решений участников.
</p>

<ul class="org-ul">
<li>Сданное решение проверяется на тестах из условия, участникам доступен полный
протокол проверки на тестах из условия. Если решение не проходит хотя бы один
тест из условия, оно оценивается в 0 баллов. Если решение проходит все тесты
из условия, то оно получает статус «Принято на проверку», при этом сразу же
проводится проверка сданного решения на всех тестах, но результат этой
проверки не сообщается участнику.
</li>

<li>Условия каждой задачи разбиваются на несколько отдельных подзадач
отличающихся, как правило, ограничениями на размер входных данных или разными
частными случаями формулировки задачи. Каждой подзадаче соответствует своя
группа тестов. Баллы за каждую подзадачу могут начисляться либо отдельно за
каждый тест (тогда сумма баллов за подзадачу равна сумме баллов за успешно
пройденные тесты), или за всю задачу целиком баллы при условии прохождения
всех тестов данной группы (если хотя бы один из тестов группы не пройден, то
баллы за группу не начисляются).
</li>

<li>По каждой задаче участник может не более 10 раз в течение тура получить
результат проверки решений на всех тестах. В этом случае участнику сообщается
результат проверки сданного решения на всех тестах. Характер сообщаемой
информации о результатах проверки указан в условии задачи и может быть
следующим: либо участнику сообщается только количество набранных баллов в
каждой подзадаче (без детализации результатов тестирования на каждом тесте),
либо участнику сообщается результат проверки задачи на каждом тесте (тест
пройден, неверный ответ, неверный формат вывода результата, превышение времени
работы программы, превышение ограничения по памяти, ошибка исполнения
программы, нарушение правил безопасности). Описание того, какая информация о
результатах проверки решения сообщается участнику по запросу, содержится в
условии каждой задачи.
</li>

<li>Если участник использовал все 10 запросов результата по какой-то задаче, то он
всё равно может отправлять решения этой задачи, но не имеет возможности
запросить результаты проверки решения данной задачи на всех тестах.
</li>

<li>Итоговый балл по каждой задаче определяется, как максимум из следующих двух
значений: максимального балла за те сданные решения, по которым участником был
запрошен протокол проверки, и баллом последнего решения, принятого на
проверку.
</li>
</ul>

</div>
</div>
</div>
</div>
